/*"use strict";

// Найти максимальное значение в массиве:
/*Math.max(...array);*/

// Найти минимальное значение в массиве:
// Math.min(...array);

// Сгенерировать случайное число от 1 до 100:
// Math.floor(Math.random() * 100) + 1;

// Проверить, является ли строка валидным числом:
/*!isNaN(parseFloat(string))

//Получить текущую дату и время:
new Date().toString()

// Проверить, является ли переменная массивом:
Array.isArray(variable)

//Проверить, является ли переменная объектом:
typeof variable === "object"

// Преобразовать массив в строку:
array.join(",")

// Проверить, является ли переменная функцией:
typeof variable === "function"

// Преобразовать объект в массив:
Object.values(object)

// Посчитать вхождения элемента в массиве:
array.filter(x => x === element).length

//Создать новый объект с динамическим ключом и значением:
{ [key]: value }

// Проверить, является ли строка палиндромом:
string === string.split("").reverse().join("");

//Получить сумму всех чисел в массиве:
array.reduce((a, b) => a + b, 0));

// Получить текущую метку времени:
Date.now()

//Проверить, является ли переменная null:
variable === null

//Проверить, является ли переменная undefined:
typeof variable === "undefined"

// Проверить, пуст ли массив:
array.length === 0

// Создать новый массив с определенным диапазоном чисел:
Array.from({ length: n }, (_, i) => i)*/
